Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20/atdf/ATSAMD20J17.atdf
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
        </register>
        <register name="PCLKSR" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
        </register>
        <register name="XOSC" offset="0x10" rw="RW" size="2" initval="0x0080" caption="XOSC Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Enable on Demand" mask="0x80"/>
          <bitfield name="GAIN" caption="Gain Value" mask="0x700"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000"/>
        </register>
        <register name="XOSC32K" offset="0x14" rw="RW" size="2" initval="0x0080" caption="XOSC32K Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
          <bitfield name="AAMPEN" caption="Automatic Amplitude Control Enable" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Enable on Demand" mask="0x80"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0x700"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
        </register>
        <register name="OSC32K" offset="0x18" rw="RW" size="4" initval="0x003F0080" caption="OSC32K Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x4"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Enable on Demand" mask="0x80"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0x700"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
          <bitfield name="CALIB" caption="Calibration Value" mask="0x7F0000"/>
        </register>
        <register name="OSCULP32K" offset="0x1C" rw="RW" size="1" initval="0x0F" caption="OSCULP32K Control">
          <bitfield name="CALIB" caption="Calibration Value" mask="0x1F"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
        <register name="OSC8M" offset="0x20" rw="RW" size="4" initval="0x87070382" caption="OSC8M Control A">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Enable on Demand" mask="0x80"/>
          <bitfield name="PRESC" caption="Prescaler Select" mask="0x300"/>
          <bitfield name="CALIB" caption="Calibration Value" mask="0xFFF0000"/>
          <bitfield name="FRANGE" caption="Frequency Range" mask="0xC0000000"/>
        </register>
        <register name="DFLLCTRL" offset="0x24" rw="RW" size="2" initval="0x0080" caption="DFLL Config">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Mode Selection" mask="0x4"/>
          <bitfield name="STABLE" caption="Stable Frequency" mask="0x8"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Enable on Demand" mask="0x80"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x100"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x200"/>
        </register>
        <register name="DFLLVAL" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="DFLL Calibration Value">
          <bitfield name="FINE" caption="Fine Calibration Value" mask="0x3FF"/>
          <bitfield name="COARSE" caption="Coarse Calibration Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="DFLL Multiplier">
          <bitfield name="MUL" caption="Multiplication Value" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Maximum Fine Step Size" mask="0x3FF0000"/>
          <bitfield name="CSTEP" caption="Maximum Coarse Step Size" mask="0xFC000000"/>
        </register>
        <register name="DFLLSYNC" offset="0x30" rw="RW" size="1" initval="0x00" caption="DFLL Synchronization">
          <bitfield name="READREQ" caption="Read Request Synchronization" mask="0x80"/>
        </register>
        <register name="BOD33" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="3.3V Brown-Out Detector (BOD33) Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="MODE" caption="Operation Modes" mask="0x100"/>
          <bitfield name="CEN" caption="Clock Enable" mask="0x200"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000"/>
          <bitfield name="LEVEL" caption="Threshold Level" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x3C" rw="RW" size="2" initval="0x0402" caption="VREG Control">
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="FORCELDO" caption="Force LDO Voltage Regulator" mask="0x2000"/>
        </register>
